In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame
from numpy.random import randn

In [2]:
ser1 = Series([1,2,3,np.nan],index=['a','b','c','d'])
ser1

a    1.0
b    2.0
c    3.0
d    NaN
dtype: float64

In [8]:
dfream1 = DataFrame({'key':['X','Y','Z','N'],'data_set1':np.arange(4)})
dfream1

   data_set1 key
0          0   X
1          1   Y
2          2   Z
3          3   N

In [9]:
dfream2 = DataFrame({'key':['Q','R','S','N'],'data_set1':np.arange(4)})
dfream2

   data_set1 key
0          0   Q
1          1   R
2          2   S
3          3   N

In [10]:
pd.merge(dfream1,dfream2)

   data_set1 key
0          3   N

In [11]:
pd.merge(dfream1,dfream2,on = 'key')

   data_set1_x key  data_set1_y
0            3   N            3

In [13]:
pd.merge(dfream1,dfream2,on = 'key',how='left')

   data_set1_x key  data_set1_y
0            0   X          NaN
1            1   Y          NaN
2            2   Z          NaN
3            3   N          3.0

In [14]:
pd.merge(dfream1,dfream2,on = 'key',how='right')

   data_set1_x key  data_set1_y
0          3.0   N            3
1          NaN   Q            0
2          NaN   R            1
3          NaN   S            2

In [23]:
pd.concat([ser1,ser1],keys=['cat1','cat2'],axis = 1)

   cat1  cat2
a   1.0   1.0
b   2.0   2.0
c   3.0   3.0
d   NaN   NaN

In [26]:
pd.concat([dfream1,dfream2],ignore_index=1)

   data_set1 key
0          0   X
1          1   Y
2          2   Z
3          3   N
4          0   Q
5          1   R
6          2   S
7          3   N

In [42]:
ser1 = Series([1,2,3,np.nan],index=['1','2','3','4'])
ser2 = Series([1,2,3,4,1,2,3])

In [35]:
Series(np.where(pd.isnull(ser1),ser2,ser1),index= ser1.index)

1    1.0
2    2.0
3    3.0
4    4.0
dtype: float64

In [39]:
ser1.combine_first(ser2)

1    1.0
2    2.0
3    3.0
4    4.0
dtype: float64

In [43]:
ser2

0    1
1    2
2    3
3    4
4    1
5    2
6    3
dtype: int64

In [44]:
ser2.drop_duplicates()

0    1
1    2
2    3
3    4
dtype: int64